---
kind: other
id: Methods.T:Autodesk.Revit.DB.AngularDimension
source: html/61933448-75be-b387-1170-87c3cb8f9970.htm
---
# AngularDimension Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.